WcfHarness/WcfHarness/RequestXmls/ManageRoleMappings.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ManageRoleMappings xmlns="http://www.tavisca.com/Vexiere/IRole/2013/01">
      <manageRoleMappingsRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:MappedRoles/>
        <a:OperationMode>AppendMode</a:OperationMode>
        <a:SourceRole i:type="a:IdBasedRoleIdentifier">
          <a:Id>1</a:Id>
        </a:SourceRole>
      </manageRoleMappingsRequest>
    </ManageRoleMappings>
  </s:Body>
</s:Envelope>